nhatVNU/nrf52840_dongle_ble_transfer/main.c
    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = true;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;


    memset(&srdata, 0, sizeof(srdata));
    srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    srdata.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data, &m_adv_data.scan_rsp_data.len);
    APP_ERROR_CHECK(err_code);

    ble_gap_adv_params_t adv_params;

    // Set advertising parameters.
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
    adv_params.duration        = APP_ADV_DURATION;
    adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    adv_params.p_peer_addr     = NULL;
    adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
    adv_params.interval        = APP_ADV_INTERVAL;

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(err_code);
    
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_lbs     Instance of LED Button Service to which the write applies.
 * @param[in] led_state Written/desired state of the LED.
 */
static void led_write_handler(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t led_state)
{
    if (led_state)
    {
        bsp_board_led_on(LEDBUTTON_LED);
        msg("Received LED ON!");
    }
    else
    {
        bsp_board_led_off(LEDBUTTON_LED);
        msg("Received LED OFF!");
    }
}

static void ble_ots_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void print_object_data(ble_ots_object_t * p_ots_obj)
{
    msg("Object data (size %i):", p_ots_obj->current_size);
    uint32_t size_to_display = p_ots_obj->current_size;
    if (size_to_display >= NRF_LOG_BACKEND_UART_TEMP_BUFFER_SIZE)
    {
        size_to_display = NRF_LOG_BACKEND_UART_TEMP_BUFFER_SIZE / 2;
        size_to_display  --;
        msg("First %i bytes of the object:", size_to_display);
        msg_hexdump(p_ots_obj->data, size_to_display);
        msg("Last %i bytes of the object:", size_to_display);
        msg_hexdump(&p_ots_obj->data[p_ots_obj->current_size - size_to_display], size_to_display);
    }
    else
    {
        msg_hexdump(p_ots_obj->data, size_to_display);
    }
}


static void ble_ots_evt_handler(ble_ots_t * p_ots, ble_ots_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case BLE_OTS_EVT_OACP:
            msg("Got oacp event %i", p_evt->evt.oacp_evt.type);

            switch (p_evt->evt.oacp_evt.type)
            {
                case BLE_OTS_OACP_EVT_REQ_READ:
                    break;
                case BLE_OTS_OACP_EVT_INCREASE_ALLOC_LEN:
                    break;
                case BLE_OTS_OACP_EVT_ABORT:
                    break;
                case BLE_OTS_OACP_EVT_EXECUTE:
                    break;
                case BLE_OTS_OACP_EVT_REQ_WRITE:
                    break;
            }
            break;

        case BLE_OTS_EVT_OBJECT:
            msg("Got object event %d, name: %s", (uint32_t)p_evt->evt.object_evt.type, (uint32_t)p_evt->evt.object_evt.evt.p_object->name);
            break;
        case BLE_OTS_EVT_INDICATION_ENABLED:
            msg("Indications Enabled");
            break;
        case BLE_OTS_EVT_INDICATION_DISABLED:
            msg("Indications Disabled");
            break;
        case BLE_OTS_EVT_OBJECT_RECEIVED:
            print_object_data(&m_ots_object);
            break;
        default:
            // no implementation needed
            break;
    }
}



/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    ble_lbs_init_t     init     = {0};
    ble_ots_init_t     ots_init = {0};
    nrf_ble_qwr_init_t qwr_init = {0};
    
    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize LBS.
    init.led_write_handler = led_write_handler;

    err_code = ble_lbs_init(&m_lbs, &init);
    APP_ERROR_CHECK(err_code);

    

    // Initialize OTS.
    memset(&ots_init, 0x00, sizeof(ots_init));

    ots_init.error_handler     = ble_ots_error_handler;
    ots_init.evt_handler       = ble_ots_evt_handler;
    ots_init.p_object          = &m_ots_object;
    ots_init.p_gatt_queue      = &m_ble_gatt_queue;

    ots_init.feature_char_read_access = SEC_OPEN;

    memset(&m_ots_object, 0, sizeof(m_ots_object));
    //Initialize our object.
    m_ots_object.is_valid                              = true;
    m_ots_object.properties.decoded.is_write_permitted = true;
    m_ots_object.properties.decoded.is_read_permitted  = true;
    m_ots_object.is_locked                             = false;
    m_ots_object.alloc_len                             = MAX_ALLOCATED_OBJECT_SIZE;

    ots_init.object_chars_init.p_ots = &m_ots;
    ots_init.object_chars_init.name_read_access = SEC_OPEN;
    ots_init.object_chars_init.type_read_access = SEC_OPEN;
    ots_init.object_chars_init.size_read_access = SEC_OPEN;
    ots_init.object_chars_init.properties_read_access = SEC_OPEN;

    ots_init.oacp_init.p_ots            = &m_ots;
    ots_init.oacp_init.l2cap_buffer_len = sizeof(m_ots_object);
    ots_init.oacp_init.p_l2cap_buffer   = m_l2cap_buffer;

