nhatVNU/nrf52840_dongle_ble_transfer/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON:
            msg("Send button state change.");
            err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE &&
                err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    //NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

void uart_error_handle(app_uart_evt_t * p_event)
{
    //if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    //{
    //    APP_ERROR_HANDLER(p_event->data.error_communication);
    //}
    //else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    //{
    //    APP_ERROR_HANDLER(p_event->data.error_code);
    //}
}


static void usbd_user_ev_handler(app_usbd_event_type_t event)
{
    switch (event)
    {
        case APP_USBD_EVT_DRV_SUSPEND:
            //bsp_board_led_off(BSP_BOARD_LED_0);
            break;
        case APP_USBD_EVT_DRV_RESUME:
            //bsp_board_led_on(BSP_BOARD_LED_0);
            break;
        case APP_USBD_EVT_STARTED:
            break;
        case APP_USBD_EVT_STOPPED:
            app_usbd_disable();
            //bsp_board_leds_off();
            break;
        case APP_USBD_EVT_POWER_DETECTED:
            //msg("USB power detected");
            
            if (!nrf_drv_usbd_is_enabled())
            {
                app_usbd_enable();
            }
            break;
        case APP_USBD_EVT_POWER_REMOVED:
            //msg("USB power removed");
            app_usbd_stop();
            break;
        case APP_USBD_EVT_POWER_READY:
            //msg("USB ready");
            app_usbd_start();
            break;
        default:
            break;
    }
}



void usb_init(void)
{
    ret_code_t err_code;
    static const app_usbd_config_t usbd_config = {
        .ev_state_proc = usbd_user_ev_handler
    };
    app_usbd_serial_num_generate();
    err_code = app_usbd_init(&usbd_config);         
    APP_ERROR_CHECK(err_code);
    
    app_usbd_class_inst_t const * class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
    err_code = app_usbd_class_append(class_cdc_acm);
    APP_ERROR_CHECK(err_code);

    if (USBD_POWER_DETECTION)
    {
        err_code = app_usbd_power_events_enable();
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        //msg("No USB power detection enabled\r\nStarting USB now");
        
        app_usbd_enable();
        app_usbd_start();
    }
}

static void bsp_event_callback(bsp_event_t ev)
{
    ret_code_t ret;
    switch ((unsigned int)ev)
    {
        case CONCAT_2(BSP_EVENT_KEY_, BTN_CDC_DATA_SEND):
        {
            m_send_flag = 1;
            break;
        }
        
        case BTN_CDC_DATA_KEY_RELEASE :
        {
            m_send_flag = 0;
            break;
        }

        case CONCAT_2(BSP_EVENT_KEY_, BTN_CDC_NOTIFY_SEND):
        {
            ret = app_usbd_cdc_acm_serial_state_notify(&m_app_cdc_acm,
                                                       APP_USBD_CDC_ACM_SERIAL_STATE_BREAK,
                                                       false);
            UNUSED_VARIABLE(ret);
            break;
        }

        default:
            return; // no implementation needed
    }
}


static void init_bsp(void)
{
    ret_code_t ret;
    ret = bsp_init(BSP_INIT_BUTTONS, bsp_event_callback);
    APP_ERROR_CHECK(ret);
    
    UNUSED_RETURN_VALUE(bsp_event_to_button_action_assign(BTN_CDC_DATA_SEND,
                                                          BSP_BUTTON_ACTION_RELEASE,
                                                          BTN_CDC_DATA_KEY_RELEASE));
    
    /* Configure LEDs */
    bsp_board_init(BSP_INIT_LEDS);
}

static void clock_init(void)
{
    ret_code_t ret = nrf_drv_clock_init();
    APP_ERROR_CHECK(ret);
    nrf_drv_clock_lfclk_request(NULL);
    while(!nrf_drv_clock_lfclk_is_running())
    {
        /* Just waiting */
    }
}


#ifdef MAIN_DEBUG
void msg(const char *format, ...)
{
    memset(m_tx_buffer, 0, NRF_DRV_USBD_EPSIZE);
    va_list args;
    va_start(args, format);
    vsnprintf(m_tx_buffer, USB_TX_BUFFER_SIZE, format, args);
    va_end(args);

    app_usbd_cdc_acm_write(&m_app_cdc_acm, m_tx_buffer, strlen(m_tx_buffer));
}
#else 
{
    
}
#endif

void msg_hexdump(const uint8_t *data, size_t data_length) {
    int len_in_line = 16; 
    char hex_buffer[len_in_line * 3 + 1]; 

    for(size_t i = 0; i < data_length; i += len_in_line){
        memset(hex_buffer, 0, sizeof(hex_buffer));
        size_t bytes_to_copy = (data_length - i < len_in_line) ? (data_length - i) : len_in_line;

        
        for (size_t j = 0; j < bytes_to_copy; j++) {
            snprintf(&hex_buffer[j * 3], 4, "%02X ", data[i + j]);
        }

        
        app_usbd_cdc_acm_write(&m_app_cdc_acm, hex_buffer, bytes_to_copy * 3);
        app_usbd_cdc_acm_write(&m_app_cdc_acm, "\r\n", 2); // Xuống dòng sau mỗi dòng hexdump
    }
}



/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t ret;

    log_init();
    clock_init();
    timers_init();
    usb_init();
    init_bsp();
    power_management_init();
    
    // Initialize BLE
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
  
    advertising_start();
     
    while (true)
    {
        while (app_usbd_event_queue_process())
        {
            /* Nothing to do */
        }
        


        idle_state_handle();
    }
}
